---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalDefinitionCreationOptions
source: html/a669cf6b-4402-fe47-da82-5b312818b3d6.htm
---
# ExternalDefinitionCreationOptions Methods

Gets the identifier describing the parameter's data type.
 The identifier may belong to either a spec or a category.
 If it is a category, the parameter is a Family Type parameter of that
 category.